mediaMicroservices/wrk2/rebuttal_results/c5.large/largephone_60s_r25.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.592ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 5.556ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.73ms    1.76ms  13.05ms   87.57%
    Req/Sec    12.20     27.53   125.00     82.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.17ms
 75.000%    5.65ms
 90.000%    8.07ms
 99.000%   13.05ms
 99.900%   17.49ms
 99.990%   19.20ms
 99.999%   19.20ms
100.000%   19.20ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.171     0.000000            1         1.00
       4.539     0.100000          120         1.11
       4.703     0.200000          242         1.25
       4.839     0.300000          362         1.43
       4.995     0.400000          478         1.67
       5.171     0.500000          599         2.00
       5.259     0.550000          658         2.22
       5.343     0.600000          715         2.50
       5.423     0.650000          775         2.86
       5.531     0.700000          835         3.33
       5.655     0.750000          894         4.00
       5.795     0.775000          925         4.44
       6.023     0.800000          953         5.00
       6.367     0.825000          983         5.71
       6.955     0.850000         1013         6.67
       7.495     0.875000         1043         8.00
       7.795     0.887500         1058         8.89
       8.071     0.900000         1072        10.00
       8.495     0.912500         1088        11.43
       8.847     0.925000         1103        13.33
       9.143     0.937500         1117        16.00
       9.303     0.943750         1125        17.78
       9.495     0.950000         1132        20.00
       9.847     0.956250         1139        22.86
      10.007     0.962500         1147        26.67
      10.367     0.968750         1154        32.00
      10.823     0.971875         1158        35.56
      10.951     0.975000         1162        40.00
      11.175     0.978125         1165        45.71
      11.399     0.981250         1169        53.33
      11.695     0.984375         1173        64.00
      11.903     0.985938         1175        71.11
      12.591     0.987500         1177        80.00
      12.935     0.989062         1178        91.43
      13.231     0.990625         1180       106.67
      13.623     0.992188         1182       128.00
      13.687     0.992969         1183       142.22
      13.999     0.993750         1184       160.00
      14.079     0.994531         1185       182.86
      14.343     0.995313         1186       213.33
      14.839     0.996094         1187       256.00
      14.839     0.996484         1187       284.44
      15.239     0.996875         1188       320.00
      15.239     0.997266         1188       365.71
      15.983     0.997656         1189       426.67
      15.983     0.998047         1189       512.00
      15.983     0.998242         1189       568.89
      17.487     0.998437         1190       640.00
      17.487     0.998633         1190       731.43
      17.487     0.998828         1190       853.33
      17.487     0.999023         1190      1024.00
      17.487     0.999121         1190      1137.78
      19.199     0.999219         1191      1280.00
      19.199     1.000000         1191          inf
#[Mean    =        5.732, StdDeviation   =        1.763]
#[Max     =       19.184, Total count    =         1191]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1454 requests in 1.00m, 261.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:     24.23
Transfer/sec:      4.35KB